Documents/РСК_ОтчетПоВыдачеТСР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РСК_ОтчетПоВыдачеТСР</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РСК_СостояниеЗаказовКлиентовПоВыдаче</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контракт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСдачиВФСС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реестр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоручениеЭкспедитору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТСР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНаправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДовЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНаправления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРеестра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРеестра</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/реа_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>реа_ПредопределенныеЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеНеогрСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РСК_СостояниеЗаказовКлиентовПоВыдаче.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>РСК_СостояниеЗаказовКлиентовПоВыдаче</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КСозданию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КВключениюВОтчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТСР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/РСК_СтатусыАктовВыдачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РСК_СтатусыАктовВыдачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗамена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОтчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РСК_ОтчетПоВыдачеТСР/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверкаНаПовторноеУчастиеАктаВОтчете(Отказ);
	ПроверкаНаПринадлежностьАктовКЗаказуКлиента(Отказ);
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	СуммаДокумента = Реестр.Итог("Сумма");
	УстановкаСтатусаВыданВУдалённыхПорученияхЭкспедитору(Отказ);
	
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Неопределено;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//Реализована на форме
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеПоРегиструСостоянияЗаказовПоВыдачеТСР(Отказ);
КонецПроцедуры

Процедура ПроверкаНаПовторноеУчастиеАктаВОтчете(Отказ)
	//++ РС Консалт: Трофимов Евгений 14.11.2022 Тикет 21892
	//e1cib/data/Документ.Задание?ref=a2f9f48080c3996a4a0f6ce4f9476921
	//Чмилева Екатерина: Не должно быть два одинаковых акта в разных отчётах
	Если НЕ РегистрыСведений.реа_ПредопределенныеЗначения.Значение("ВыдачаТСР_ПроверкаНаПовторноеУчастиеАктаВОтчете", Истина) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РСК_ОтчетПоВыдачеТСРРеестр.Ссылка КАК Ссылка,
		|	РСК_ОтчетПоВыдачеТСРРеестр.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕ(РСК_ОтчетПоВыдачеТСРРеестр.Акт) КАК Акт,
		|	ПРЕДСТАВЛЕНИЕ(РСК_ОтчетПоВыдачеТСРРеестр.Заявитель) КАК Заявитель,
		|	ПРЕДСТАВЛЕНИЕ(РСК_ОтчетПоВыдачеТСРРеестр.Ссылка) КАК Отчет,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Акт КАК АктСсылка
		|ИЗ
		|	Документ.РСК_ОтчетПоВыдачеТСР.Реестр КАК РСК_ОтчетПоВыдачеТСРРеестр
		|ГДЕ
		|	РСК_ОтчетПоВыдачеТСРРеестр.Ссылка <> &Ссылка
		|	И РСК_ОтчетПоВыдачеТСРРеестр.Ссылка.Проведен
		|	И РСК_ОтчетПоВыдачеТСРРеестр.Акт В(&Акты)";
	
	Запрос.УстановитьПараметр("Акты", Реестр.Выгрузить().ВыгрузитьКолонку("Акт"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
				"%1 заявителя %2 уже был представлен в документе %3",
				Выборка.Акт,
				Выборка.Заявитель,
				Выборка.Отчет
			),
			Выборка.Ссылка,
			"Реестр["+XMLСтрока(Выборка.НомерСтроки-1)+"].Акт",,
			Отказ
		);
		
		НайденныеСтроки = Реестр.НайтиСтроки(Новый Структура("Акт", Выборка.АктСсылка));
		
		ОбщегоНазначения.СообщитьПользователю(
			"В этом документе тот-же акт указан в строке "+НайденныеСтроки[0].НомерСтроки,,
			"Реестр["+XMLСтрока(НайденныеСтроки[0].НомерСтроки - 1)+"].Акт",
			"Объект",
			Отказ
		);
		
	КонецЦикла;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоручениеЭкспедитору.Ссылка КАК АктСсылка,
		|	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(50)) КАК ОтчётПоВыдачеУТ,
		|	ПРЕДСТАВЛЕНИЕ(ПоручениеЭкспедитору.Ссылка) КАК Акт
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ПО ДополнительныеСведения.Объект = ПоручениеЭкспедитору.Ссылка
		|ГДЕ
		|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Документ.ПоручениеЭкспедитору) В (&Акты)
		|	И ДополнительныеСведения.Свойство = &ДопСвойство
		|	И (ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(50))) <> """"
		|";
	Запрос.УстановитьПараметр("ДопСвойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ОтчётПоВыдачеУТ"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Реестр.НайтиСтроки(Новый Структура("Акт", Выборка.АктСсылка));
		ОбщегоНазначения.СообщитьПользователю(
			Выборка.Акт + " уже был представлен в УТ в Отчёте по выдаче "+Выборка.ОтчётПоВыдачеУТ,,
			"Реестр["+XMLСтрока(НайденныеСтроки[0].НомерСтроки - 1)+"].Акт",
			"Объект",
			Отказ
		);
	КонецЦикла;	
	//-- КонецТикета 21892
КонецПроцедуры

Процедура ПроверкаНаПринадлежностьАктовКЗаказуКлиента(Отказ)
	//++ РС Консалт: Трофимов Евгений 15.11.2022 Тикет 21892
	//e1cib/data/Документ.Задание?ref=a2f9f48080c3996a4a0f6ce4f9476921
	Если НЕ РегистрыСведений.реа_ПредопределенныеЗначения.Значение("ВыдачаТСР_ПроверкаНаПринадлежностьАктовКЗаказуКлиента", Истина)
		ИЛИ НЕ ЗначениеЗаполнено(Контракт) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоручениеЭкспедитору.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
		|		ПО ПоручениеЭкспедитору.Ссылка = ПоручениеЭкспедиторуОснования.Ссылка
		|			И (ПоручениеЭкспедиторуОснования.Основание = &ЗаказКлиента)
		|ГДЕ
		|	ПоручениеЭкспедитору.Ссылка В(&Акты)
		|	И ПоручениеЭкспедиторуОснования.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Акты", Реестр.Выгрузить().ВыгрузитьКолонку("Акт"));
	Запрос.УстановитьПараметр("ЗаказКлиента", Контракт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Реестр.НайтиСтроки(Новый Структура("Акт", Выборка.Ссылка));
		ОбщегоНазначения.СообщитьПользователю(
			""+ Выборка.Ссылка + " не привязан к документу "+Контракт,,
			"Реестр["+XMLСтрока(НайденныеСтроки[0].НомерСтроки - 1)+"].Акт",
			"Объект",
			Отказ
		);
	КонецЦикла;
	//-- КонецТикета 21892	
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПроведениеПоРегиструСостоянияЗаказовПоВыдачеТСР(Отказ)

	Движения.РСК_СостояниеЗаказовКлиентовПоВыдаче.Очистить();
	Движения.РСК_СостояниеЗаказовКлиентовПоВыдаче.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РСК_ОтчетПоВыдачеТСРРеестр.Ссылка.Дата КАК Период,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Ссылка.Контракт КАК Заказ,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Цена КАК Цена,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Количество КАК КВключениюВОтчет,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Акт КАК Акт,
		|	РСК_ОтчетПоВыдачеТСРРеестр.ТСР КАК ТСР,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Номенклатура КАК Номенклатура,
		|	РСК_ОтчетПоВыдачеТСРРеестр.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ПоручениеЭкспедитору.РСК_Серия КАК Серия
		|ИЗ
		|	Документ.РСК_ОтчетПоВыдачеТСР.Реестр КАК РСК_ОтчетПоВыдачеТСРРеестр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ПО РСК_ОтчетПоВыдачеТСРРеестр.Акт = ПоручениеЭкспедитору.Ссылка
		|ГДЕ
		|	РСК_ОтчетПоВыдачеТСРРеестр.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.РСК_СостояниеЗаказовКлиентовПоВыдаче.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		оАкт = Выборка.Акт.ПолучитьОбъект();
		оАкт.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.ВОтчете;
		оАкт.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
		
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура УстановкаСтатусаВыданВУдалённыхПорученияхЭкспедитору(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РСК_ОтчетПоВыдачеТСРРеестр.Акт КАК Акт
		|ИЗ
		|	Документ.РСК_ОтчетПоВыдачеТСР.Реестр КАК РСК_ОтчетПоВыдачеТСРРеестр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ПО РСК_ОтчетПоВыдачеТСРРеестр.Акт = ПоручениеЭкспедитору.Ссылка
		|ГДЕ
		|	РСК_ОтчетПоВыдачеТСРРеестр.Ссылка = &Ссылка
		|	И НЕ РСК_ОтчетПоВыдачеТСРРеестр.Акт В (&МассивНесохранённыхАктов)
		|	И ПоручениеЭкспедитору.РСК_СтатусАктаВыдачиТСР = Значение(Перечисление.РСК_СтатусыАктовВыдачи.ВОтчете)";
	
	Запрос.УстановитьПараметр("МассивНесохранённыхАктов", Реестр.Выгрузить().ВыгрузитьКолонку("Акт"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументАкт = Выборка.Акт.ПолучитьОбъект();
		ДокументАкт.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Выдан;
		Попытка
			ДокументАкт.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(
				"Не удалось записать документ "+Строка(Выборка.Акт)+ " со статусом «Выдан». " +ОписаниеОшибки(),
				Выборка.Акт,,,
				Отказ
			);
			Возврат;
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ОбработкаУдаленияПроведения(Отказ)
	Для каждого ТекСтр из Реестр Цикл
		Об = ТекСтр.Акт.ПолучитьОбъект();
		Об.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Выдан;
		Об.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

#КонецЕсли
